Revit 2027 API
FailureHandlingOptions.GetForcedModalHandling Method
 Obtains the flag indicating if the error handling dialog shown at the end of the failing transaction should be modal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetForcedModalHandling()
Public Function GetForcedModalHandling As Boolean
public:
bool GetForcedModalHandling()
member GetForcedModalHandling : unit -> bool
Return Value
Boolean
 True if the options force Revit to use a modal error dialog, false if it allows use of a non-blocking dialog for warnings resulting from this transaction.
See Also
Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace